// 日別のタスク
const cleaningTasks = {
    1: "",
    2: "",
    3: "不用品確認〜廃棄",
    4: "",
    5: "洗面所掃除",
    6: "食器棚掃除",
    7: "ガスレンジ掃除",
    8: "",
    9: "冷蔵庫内の掃除",
    10: "冷凍庫内の掃除",
    11: "",
    12: "炊飯器の掃除",
    13: "電子レンジの掃除",
    14: "オーブンの掃除",
    15: "",
    16: "加湿器・除湿機の掃除",
    17: "",
    18: "不用品確認〜廃棄",
    19: "",
    20: "家の中の物置の掃除",
    21: "",
    22: "ハムスターの水槽の掃除（きなこ）",
    23: "排水口の掃除",
    24: "下駄箱の掃除",
    25: "トイレ清掃",
    26: "床拭き",
    27: "通気口のフィルター交換",
    28: "",
    29: "",
    30: "",
    31: ""
};

// 曜日別のタスク
const weeklyTasks = {
    "月曜日": ["玄関の掃除"],
    "火曜日": ["燃やせるゴミ", "部屋のホコリ取り", "掃除機がけ"],
    "水曜日": ["燃やせないor缶・ビン・ペットボトルゴミ"],
    "木曜日": ["プラ容器ゴミ"],
    "金曜日": ["燃やせるゴミ", "洗面台の掃除"],
    "土曜日": ["トイレ掃除", "部屋のホコリ取り", "掃除機がけ", "洗車"],
    "日曜日": ["風呂掃除", "整理整頓"]
};

// 月別のタスク
const monthlyTasks = {
    1: [],
    2: [],
    3: [],
    4: ["エアコン清掃", "風呂換気扇清掃", "扇風機ホコリ取り"],
    5: ["備え付けストーブ清掃", "灯油ストーブ清掃", "外の物置片付け", "車のタイヤ交換"],
    6: ["洗濯機清掃", "キッチン換気扇清掃"],
    7: [],
    8: ["カーテン洗濯"],
    9: [],
    10: ["居間の壁拭き"],
    11: ["ベランダ清掃", "エアコン室外機清掃", "車のタイヤ交換"],
    12: ["窓拭き", "洗濯機清掃", "トイレ換気扇清掃", "部屋の換気扇清掃"]
};